<?php
$data['words'] = array (
  'filter' => 
  array (
    'find' => 
    array (
      0 => '/美女上门/i',
      1 => '/上网文凭/i',
      2 => '/赌博机/i',
      3 => '/卖血/i',
      4 => '/出售肾/i',
      5 => '/出售器官/i',
      6 => '/眼角膜/i',
      7 => '/求肾/i',
      8 => '/换肾/i',
      9 => '/有偿肾/i',
      10 => '/预测答案/i',
      11 => '/考前预测/i',
      12 => '/押题/i',
    ),
    'replace' => 
    array (
      0 => '***',
      1 => '***',
      2 => '***',
      3 => '***',
      4 => '***',
      5 => '***',
      6 => '***',
      7 => '***',
      8 => '***',
      9 => '***',
      10 => '***',
      11 => '***',
      12 => '***',
    ),
  ),
  'banned' => 
  array (
    0 => '/(法轮|fa轮|9评|九凭|LHZ|自焚|藏字石|李洪X|9ping|九ping|自fen|法X功|轮子功)/i',
  ),
);

?>